## 数据转换

In [2]:
import numpy as np

In [3]:
import pandas as pd

回顾一下stack和unstack

In [4]:
np.arange(6)

array([0, 1, 2, 3, 4, 5])

In [7]:
data=pd.DataFrame(np.arange(6).reshape(2,3),index=['xiaoming','xiaoli'],columns=['one','two','three'])#np.arange(6).reshape(2,3)

In [10]:
data_s=pd.DataFrame(np.arange(6))

In [11]:
data_s

   0
0  0
1  1
2  2
3  3
4  4
5  5

In [8]:
data_s=pd.DataFrame(np.arange(6).reshape(2,3))

In [9]:
data_s

   0  1  2
0  0  1  2
1  3  4  5

In [12]:
data

          one  two  three
xiaoming    0    1      2
xiaoli      3    4      5

In [14]:
data.unstack()#层次化索引

one    xiaoming    0
       xiaoli      3
two    xiaoming    1
       xiaoli      4
three  xiaoming    2
       xiaoli      5
dtype: int32

In [16]:
data.stack()#把列索引嵌入行

xiaoming  one      0
          two      1
          three    2
xiaoli    one      3
          two      4
          three    5
dtype: int32

## 重复数据处理

In [17]:
data=pd.DataFrame({'k1':['one']*3+['two']*2,'k2':[1,1,2,3,3]})

In [18]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3

In [19]:
data.duplicated()#第一个不显示，第二个重复显示

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [21]:
data.drop_duplicates()#扔掉重复项
data.drop_duplicates()#按k1,k2都重复的扔掉了

    k1  k2
0  one   1
2  one   2
3  two   3

In [22]:
data.drop_duplicates('k1')#按k1的重复扔掉了

    k1  k2
0  one   1
3  two   3

## 替换数据

In [23]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3

In [26]:
data.replace(2,np.nan)#np.nan

    k1   k2
0  one  1.0
1  one  1.0
2  one  NaN
3  two  3.0
4  two  3.0

In [28]:
data.replace([2,3],np.nan)#np.nan

    k1   k2
0  one  1.0
1  one  1.0
2  one  NaN
3  two  NaN
4  two  NaN

## 字符串的操作

In [34]:
data=pd.DataFrame({'k1':['beijing,haidian,chushou','beijing,chaoyang,chushou','beijing,fengtai,chuzu'],'k2':['beijing,xicheng,chuzu','beijing,shijingshan,chushou',np.nan]})

In [35]:
data

                         k1                           k2
0   beijing,haidian,chushou        beijing,xicheng,chuzu
1  beijing,chaoyang,chushou  beijing,shijingshan,chushou
2     beijing,fengtai,chuzu                          NaN

In [42]:
data.k2.map(lambda x:x.replace('beijing','shanghai'))#将beijing替换为shanghai,因为有nan所以会报错

AttributeError: 'float' object has no attribute 'replace'

In [43]:
data_s=data.k2.str.replace('beijing','shanghai')#data.k2.str,DataFrame的字符串方法

In [44]:
data_s

0          shanghai,xicheng,chuzu
1    shanghai,shijingshan,chushou
2                             NaN
Name: k2, dtype: object

In [45]:
data.k1.str.contains('chushou')#contains方法包含

0     True
1     True
2    False
Name: k1, dtype: bool

In [46]:
data.k1.str.upper()#大写

0     BEIJING,HAIDIAN,CHUSHOU
1    BEIJING,CHAOYANG,CHUSHOU
2       BEIJING,FENGTAI,CHUZU
Name: k1, dtype: object

In [48]:
data

                         k1                           k2
0   beijing,haidian,chushou        beijing,xicheng,chuzu
1  beijing,chaoyang,chushou  beijing,shijingshan,chushou
2     beijing,fengtai,chuzu                          NaN

In [47]:
data.k1.str.split(',')#返回列表

0     [beijing, haidian, chushou]
1    [beijing, chaoyang, chushou]
2       [beijing, fengtai, chuzu]
Name: k1, dtype: object

## 数据的离散化

In [49]:
import pandas as pd
import numpy as np

为了便于分析，连续数据常常被离散化

In [52]:
data=pd.DataFrame(np.random.randint(1,50,(20,2)),columns=['k1','k2'])

In [53]:
data

    k1  k2
0    7  22
1   21  24
2    8  46
3    9  26
4   49  32
5   32  10
6   31   9
7   26  20
8    2  26
9   36  11
10   1   4
11  47  25
12  34  16
13  43  19
14  34  25
15  13  11
16  42   3
17  33  24
18  15   8
19  20  21

In [54]:
bins=[0,10,20,30,40,50]

In [55]:
cats=pd.cut(data.k1,bins)#pd.cut

In [56]:
cats

0      (0, 10]
1     (20, 30]
2      (0, 10]
3      (0, 10]
4     (40, 50]
5     (30, 40]
6     (30, 40]
7     (20, 30]
8      (0, 10]
9     (30, 40]
10     (0, 10]
11    (40, 50]
12    (30, 40]
13    (40, 50]
14    (30, 40]
15    (10, 20]
16    (40, 50]
17    (30, 40]
18    (10, 20]
19    (10, 20]
Name: k1, dtype: category
Categories (5, interval[int64]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50]]

In [57]:
cats.value_counts()

(30, 40]    6
(0, 10]     5
(40, 50]    4
(10, 20]    3
(20, 30]    2
Name: k1, dtype: int64

In [62]:
cats=pd.cut(data.k1,4)#分成4份

In [63]:
cats

0     (0.952, 13.0]
1      (13.0, 25.0]
2     (0.952, 13.0]
3     (0.952, 13.0]
4      (37.0, 49.0]
5      (25.0, 37.0]
6      (25.0, 37.0]
7      (25.0, 37.0]
8     (0.952, 13.0]
9      (25.0, 37.0]
10    (0.952, 13.0]
11     (37.0, 49.0]
12     (25.0, 37.0]
13     (37.0, 49.0]
14     (25.0, 37.0]
15    (0.952, 13.0]
16     (37.0, 49.0]
17     (25.0, 37.0]
18     (13.0, 25.0]
19     (13.0, 25.0]
Name: k1, dtype: category
Categories (4, interval[float64]): [(0.952, 13.0] < (13.0, 25.0] < (25.0, 37.0] < (37.0, 49.0]]

In [64]:
cats=pd.cut(data.k2,4)

In [65]:
cats

0      (13.75, 24.5]
1      (13.75, 24.5]
2      (35.25, 46.0]
3      (24.5, 35.25]
4      (24.5, 35.25]
5     (2.957, 13.75]
6     (2.957, 13.75]
7      (13.75, 24.5]
8      (24.5, 35.25]
9     (2.957, 13.75]
10    (2.957, 13.75]
11     (24.5, 35.25]
12     (13.75, 24.5]
13     (13.75, 24.5]
14     (24.5, 35.25]
15    (2.957, 13.75]
16    (2.957, 13.75]
17     (13.75, 24.5]
18    (2.957, 13.75]
19     (13.75, 24.5]
Name: k2, dtype: category
Categories (4, interval[float64]): [(2.957, 13.75] < (13.75, 24.5] < (24.5, 35.25] < (35.25, 46.0]]

In [68]:
cats.value_counts()#h划分数据行数

(13.75, 24.5]     7
(2.957, 13.75]    7
(24.5, 35.25]     5
(35.25, 46.0]     1
Name: k2, dtype: int64

In [70]:
cats=pd.qcut(data.k1,4)#qcut(data,4),qcut数据数量的等分

In [71]:
cats

0     (0.999, 12.0]
1      (12.0, 28.5]
2     (0.999, 12.0]
3     (0.999, 12.0]
4      (34.5, 49.0]
5      (28.5, 34.5]
6      (28.5, 34.5]
7      (12.0, 28.5]
8     (0.999, 12.0]
9      (34.5, 49.0]
10    (0.999, 12.0]
11     (34.5, 49.0]
12     (28.5, 34.5]
13     (34.5, 49.0]
14     (28.5, 34.5]
15     (12.0, 28.5]
16     (34.5, 49.0]
17     (28.5, 34.5]
18     (12.0, 28.5]
19     (12.0, 28.5]
Name: k1, dtype: category
Categories (4, interval[float64]): [(0.999, 12.0] < (12.0, 28.5] < (28.5, 34.5] < (34.5, 49.0]]

In [77]:
cats

0     (0.999, 12.0]
1      (12.0, 28.5]
2     (0.999, 12.0]
3     (0.999, 12.0]
4      (34.5, 49.0]
5      (28.5, 34.5]
6      (28.5, 34.5]
7      (12.0, 28.5]
8     (0.999, 12.0]
9      (34.5, 49.0]
10    (0.999, 12.0]
11     (34.5, 49.0]
12     (28.5, 34.5]
13     (34.5, 49.0]
14     (28.5, 34.5]
15     (12.0, 28.5]
16     (34.5, 49.0]
17     (28.5, 34.5]
18     (12.0, 28.5]
19     (12.0, 28.5]
Name: k1, dtype: category
Categories (4, interval[float64]): [(0.999, 12.0] < (12.0, 28.5] < (28.5, 34.5] < (34.5, 49.0]]

In [74]:
cats.value_counts()#pd.qcut(data,4)，数量4等分,value_counts()

(34.5, 49.0]     5
(28.5, 34.5]     5
(12.0, 28.5]     5
(0.999, 12.0]    5
Name: k1, dtype: int64

In [79]:
cats.value_counts()

(34.5, 49.0]     5
(28.5, 34.5]     5
(12.0, 28.5]     5
(0.999, 12.0]    5
Name: k1, dtype: int64

In [81]:
cats=pd.qcut(data.k2,4)

In [82]:
cats

0       (20.5, 25.0]
1       (20.5, 25.0]
2       (25.0, 46.0]
3       (25.0, 46.0]
4       (25.0, 46.0]
5     (2.999, 10.75]
6     (2.999, 10.75]
7      (10.75, 20.5]
8       (25.0, 46.0]
9      (10.75, 20.5]
10    (2.999, 10.75]
11      (20.5, 25.0]
12     (10.75, 20.5]
13     (10.75, 20.5]
14      (20.5, 25.0]
15     (10.75, 20.5]
16    (2.999, 10.75]
17      (20.5, 25.0]
18    (2.999, 10.75]
19      (20.5, 25.0]
Name: k2, dtype: category
Categories (4, interval[float64]): [(2.999, 10.75] < (10.75, 20.5] < (20.5, 25.0] < (25.0, 46.0]]

In [85]:
cats.value_counts()

(20.5, 25.0]      6
(10.75, 20.5]     5
(2.999, 10.75]    5
(25.0, 46.0]      4
Name: k2, dtype: int64